#!/usr/bin/env bash
#脚本里只要有一个命令失败（返回值非 0），整个脚本就立刻退出
set -e
export LD_LIBRARY_PATH=/home/extra_home/lxx23125236/ali/LightGBM/lib:$LD_LIBRARY_PATH
# -------- 1️⃣ 构建配置 --------
BUILD_DIR=/home/extra_home/lxx23125236/ali/NSG/cmake-build-lxx-release

/home/lxx23125236/.cache/JetBrains/RemoteDev/dist/0a55911a5a2e1_CLion-2024.1.1/bin/cmake/linux/x64/bin/cmake \
  -S /home/extra_home/lxx23125236/ali/NSG \
  -B ${BUILD_DIR} \
  -G Ninja \
  -DCMAKE_BUILD_TYPE=Release \

# -------- 2️⃣ 编译 --------
ninja -C ${BUILD_DIR} test_nsg_optimized_search


echo ""
echo "============= Build Done (Release) ============="
echo ""

TRAIN_DATA_DIRECTORY=/home/extra_home/lxx23125236/ali/NSG-data/train_data/Laet_Darth_train_data/

sample=10000
dataset_params=(
#  "SIFT1M  500"
#  "GLOVE100  500"
#  "GIST1M  1000"
#  "DEEP10M  750"
   "T2I1M 1000"
)


k_values=(100)
recall_values=(0.95 0.96 0.97 0.98 0.99)

for dataset_param in "${dataset_params[@]}"
do
    read ds efSFULL <<< "$dataset_param"
    echo ""
    echo "--------------- ${ds} ---------------"
    echo ""
    for k in "${k_values[@]}"
    do
        echo ""
        echo "--------------- k=${k} ---------------"
        echo ""
        for recall in "${recall_values[@]}"; do
          if true; then
            python /home/extra_home/lxx23125236/ali/NSG/experiment/0-k100-full/3-Darth/1-1-获取darth需要的distRT.py \
                  "${TRAIN_DATA_DIRECTORY}${ds}/k${k}/efS${efSFULL}_qs${sample}_full.txt" \
                  "$recall"
          fi
        done
    done
    echo ""
    echo ""
done
exit
#--------------- SIFT1M ---------------
#
#
#--------------- k=100 ---------------
#
#目标准确率: r >= 0.9500
#成功达到目标的查询数量: 9999
#平均距离计算次数 (dists): 2648.48
#ipi: 1324
#mpi: 265
#===============================
#目标准确率: r >= 0.9600
#成功达到目标的查询数量: 9996
#平均距离计算次数 (dists): 2826.00
#ipi: 1413
#mpi: 283
#===============================
#目标准确率: r >= 0.9700
#成功达到目标的查询数量: 9990
#平均距离计算次数 (dists): 3056.70
#ipi: 1528
#mpi: 306
#===============================
#目标准确率: r >= 0.9800
#成功达到目标的查询数量: 9977
#平均距离计算次数 (dists): 3361.63
#ipi: 1681
#mpi: 336
#===============================
#目标准确率: r >= 0.9900
#成功达到目标的查询数量: 9895
#平均距离计算次数 (dists): 3807.05
#ipi: 1904
#mpi: 381
#===============================
#
#
#
#--------------- GLOVE100 ---------------
#
#
#--------------- k=100 ---------------
#
#目标准确率: r >= 0.9500
#成功达到目标的查询数量: 9771
#平均距离计算次数 (dists): 1255.11
#ipi: 628
#mpi: 126
#===============================
#目标准确率: r >= 0.9600
#成功达到目标的查询数量: 9725
#平均距离计算次数 (dists): 1283.68
#ipi: 642
#mpi: 128
#===============================
#目标准确率: r >= 0.9700
#成功达到目标的查询数量: 9666
#平均距离计算次数 (dists): 1320.39
#ipi: 660
#mpi: 132
#===============================
#目标准确率: r >= 0.9800
#成功达到目标的查询数量: 9584
#平均距离计算次数 (dists): 1379.56
#ipi: 690
#mpi: 138
#===============================
#目标准确率: r >= 0.9900
#成功达到目标的查询数量: 9430
#平均距离计算次数 (dists): 1466.18
#ipi: 733
#mpi: 147
#===============================
#
#
#
#--------------- GIST1M ---------------
#
#
#--------------- k=100 ---------------
#
#目标准确率: r >= 0.9500
#成功达到目标的查询数量: 9946
#平均距离计算次数 (dists): 7772.60
#ipi: 3886
#mpi: 777
#===============================
#目标准确率: r >= 0.9600
#成功达到目标的查询数量: 9896
#平均距离计算次数 (dists): 8400.35
#ipi: 4200
#mpi: 840
#===============================
#目标准确率: r >= 0.9700
#成功达到目标的查询数量: 9818
#平均距离计算次数 (dists): 9180.11
#ipi: 4590
#mpi: 918
#===============================
#目标准确率: r >= 0.9800
#成功达到目标的查询数量: 9619
#平均距离计算次数 (dists): 10133.37
#ipi: 5067
#mpi: 1013
#===============================
#目标准确率: r >= 0.9900
#成功达到目标的查询数量: 9182
#平均距离计算次数 (dists): 11325.28
#ipi: 5663
#mpi: 1133
#===============================
#
#
#
#--------------- DEEP10M ---------------
#
#
#--------------- k=100 ---------------
#
#目标准确率: r >= 0.9500
#成功达到目标的查询数量: 9787
#平均距离计算次数 (dists): 4131.69
#ipi: 2066
#mpi: 413
#===============================
#目标准确率: r >= 0.9600
#成功达到目标的查询数量: 9724
#平均距离计算次数 (dists): 4421.42
#ipi: 2211
#mpi: 442
#===============================
#目标准确率: r >= 0.9700
#成功达到目标的查询数量: 9621
#平均距离计算次数 (dists): 4767.49
#ipi: 2384
#mpi: 477
#===============================
#目标准确率: r >= 0.9800
#成功达到目标的查询数量: 9464
#平均距离计算次数 (dists): 5179.67
#ipi: 2590
#mpi: 518
#===============================
#目标准确率: r >= 0.9900
#成功达到目标的查询数量: 9156
#平均距离计算次数 (dists): 5728.89
#ipi: 2864
#mpi: 573
#===============================
#
