#!/usr/bin/env bash
#脚本里只要有一个命令失败（返回值非 0），整个脚本就立刻退出
set -e
export LD_LIBRARY_PATH=/home/extra_home/lxx23125236/ali/LightGBM/lib:$LD_LIBRARY_PATH
# -------- 1️⃣ 构建配置 --------
BUILD_DIR=/home/extra_home/lxx23125236/ali/NSG/cmake-build-lxx-release

/home/lxx23125236/.cache/JetBrains/RemoteDev/dist/0a55911a5a2e1_CLion-2024.1.1/bin/cmake/linux/x64/bin/cmake \
  -S /home/extra_home/lxx23125236/ali/NSG \
  -B ${BUILD_DIR} \
  -G Ninja \
  -DCMAKE_BUILD_TYPE=Release \

# -------- 2️⃣ 编译 --------
ninja -C ${BUILD_DIR} test_nsg_optimized_search


echo ""
echo "============= Build Done (Release) ============="
echo ""
#数据集和每个数据集中  构建训练数据集时采用的efS 测试集中的查询点数量
dataset_params=(
  "SIFT1M 500 10000"
  "GLOVE100 500 10000"
  "GIST1M 1000 1000"
  "DEEP10M 750 10000"
)
MODEL_DIRECTORY=/root/NSG-data/predictor_models/darth
RESULTS_DIRECTORY=/root/NSG-data/results/darth
experiment_times=1
mode=Darth_test_metrics
k_values=(100)
train_queries=10000
n_estimators=100
#要求准确率，搜索时的CNS大小，ipi，mpi
SIFT1M_tuples_k100=(
  "0.95 500 1324 265"
  "0.96 500 1413 283"
  "0.97 500 1528 306"
  "0.98 500 1681 336"
  "0.99 500 1904 381"
)

GLOVE100_tuples_k100=(
  "0.95 500 628 126"
  "0.96 500 642 128"
  "0.97 500 660 132"
  "0.98 500 690 138"
  "0.99 500 733 147"
)

GIST1M_tuples_k100=(
  "0.95 1000 3886 777"
  "0.96 1000 4200 840"
  "0.97 1000 4590 918"
  "0.98 1000 5067 1013"
  "0.99 1000 5663 1133"
)

DEEP10M_tuples_k100=(
  "0.95 750 2066 413"
  "0.96 750 2211 442"
  "0.97 750 2384 477"
  "0.98 750 2590 518"
  "0.99 750 2864 573"
)

for dataset_param in "${dataset_params[@]}"
do
    read ds efS_train query_num<<< "$dataset_param"

    echo ""
    echo "--------------- ${ds} ---------------"
    echo ""

    for k in "${k_values[@]}"
    do
        echo ""
        echo "--------------- k=${k} ---------------"
        echo ""

        if [ "$ds" == "SIFT1M" ]; then
            if [ "$k" == "100" ]; then
                tuples=("${SIFT1M_tuples_k100[@]}")
            elif [ "$k" == "10" ]; then
                tuples=("${SIFT1M_tuples_k10[@]}")
            fi
        elif [ "$ds" == "DEEP10M" ]; then
            if [ "$k" == "100" ]; then
                tuples=("${DEEP10M_tuples_k100[@]}")
            elif [ "$k" == "10" ]; then
                tuples=("${DEEP10M_tuples_k10[@]}")
            fi
        elif [ "$ds" == "GIST1M" ]; then
            if [ "$k" == "100" ]; then
                tuples=("${GIST1M_tuples_k100[@]}")
            elif [ "$k" == "10" ]; then
                tuples=("${GIST1M_tuples_k10[@]}")
            fi
        elif [ "$ds" == "GLOVE100" ]; then
            if [ "$k" == "100" ]; then
                tuples=("${GLOVE100_tuples_k100[@]}")
            elif [ "$k" == "10" ]; then
                tuples=("${GLOVE100_tuples_k10[@]}")
            fi
        fi

        for tuple in "${tuples[@]}"; do
          read target_recall efS ipi mpi <<< "$tuple"
          echo ">>> target_recall=${target_recall}"
          mkdir -p ${RESULTS_DIRECTORY}/${ds}/k${k}
          ${BUILD_DIR}/tests/test_nsg_optimized_search \
            --dataset=${ds} \
            --K=$k \
            --L=${efS} \
            --mode=${mode} \
            --query_type=test \
            --query_num=${query_num} \
            --ipi=${ipi} \
            --mpi=${mpi} \
            --model_path=${MODEL_DIRECTORY}/${ds}/k${k}/efS${efS_train}_s${train_queries}_nestim${n_estimators}_all_feats.txt \
            --target_recall=${target_recall} \
            --out_put_path=${RESULTS_DIRECTORY}/${ds}/k${k}/metrics_recall${target_recall}.json
        done
    done
    echo ""
    echo ""
done


============= Build Done (Release) =============
--------------- SIFT1M ---------------


--------------- k=100 ---------------

>>> target_recall=0.95
模型预测次数:58312
总模型预测时间(s):0.649309 seconds
100 NN 准确率 = 0.970376
低于要求准确率:0.950000的占比为0.162300
平均每个数据点上的早停率:0.995900
平均每个数据点上的成功早停率:0.833700
平均每次预测的成功早停率:0.142972
>>> target_recall=0.96
模型预测次数:62611
总模型预测时间(s):0.676774 seconds
100 NN 准确率 = 0.977768
低于要求准确率:0.960000的占比为0.148000
平均每个数据点上的早停率:0.987300
平均每个数据点上的成功早停率:0.839500
平均每次预测的成功早停率:0.134082
>>> target_recall=0.97
模型预测次数:69003
总模型预测时间(s):0.718167 seconds
100 NN 准确率 = 0.984406
低于要求准确率:0.970000的占比为0.132300
平均每个数据点上的早停率:0.965200
平均每个数据点上的成功早停率:0.833400
平均每次预测的成功早停率:0.120777
>>> target_recall=0.98
模型预测次数:78218
总模型预测时间(s):0.813926 seconds
100 NN 准确率 = 0.990133
低于要求准确率:0.980000的占比为0.124400
平均每个数据点上的早停率:0.917900
平均每个数据点上的成功早停率:0.795400
平均每次预测的成功早停率:0.101690
>>> target_recall=0.99
模型预测次数:91339
总模型预测时间(s):0.917862 seconds
100 NN 准确率 = 0.994898
低于要求准确率:0.990000的占比为0.119800
平均每个数据点上的早停率:0.803000
平均每个数据点上的成功早停率:0.690000
平均每次预测的成功早停率:0.075543



--------------- GLOVE100 ---------------


--------------- k=100 ---------------

>>> target_recall=0.95
tcmalloc: large alloc 1358675968 bytes == 0x555c0bcbe000 @
模型预测次数:84080
总模型预测时间(s):0.709997 seconds
100 NN 准确率 = 0.972314
低于要求准确率:0.950000的占比为0.168400
平均每个数据点上的早停率:0.941600
平均每个数据点上的成功早停率:0.790600
平均每次预测的成功早停率:0.094029
>>> target_recall=0.96
tcmalloc: large alloc 1358675968 bytes == 0x55f3577a6000 @
模型预测次数:104267
总模型预测时间(s):0.856677 seconds
100 NN 准确率 = 0.978543
低于要求准确率:0.960000的占比为0.147300
平均每个数据点上的早停率:0.915400
平均每个数据点上的成功早停率:0.790400
平均每次预测的成功早停率:0.075805
>>> target_recall=0.97
tcmalloc: large alloc 1358675968 bytes == 0x55e16eac2000 @
模型预测次数:131411
总模型预测时间(s):1.046692 seconds
100 NN 准确率 = 0.984607
低于要求准确率:0.970000的占比为0.123100
平均每个数据点上的早停率:0.872800
平均每个数据点上的成功早停率:0.778400
平均每次预测的成功早停率:0.059234
>>> target_recall=0.98
tcmalloc: large alloc 1358675968 bytes == 0x55cdc4abc000 @
模型预测次数:165550
总模型预测时间(s):1.283767 seconds
100 NN 准确率 = 0.989779
低于要求准确率:0.980000的占比为0.103600
平均每个数据点上的早停率:0.811400
平均每个数据点上的成功早停率:0.744600
平均每次预测的成功早停率:0.044977
>>> target_recall=0.99
tcmalloc: large alloc 1358675968 bytes == 0x55de09c3c000 @
模型预测次数:215617
总模型预测时间(s):1.629141 seconds
100 NN 准确率 = 0.993525
低于要求准确率:0.990000的占比为0.089500
平均每个数据点上的早停率:0.729500
平均每个数据点上的成功早停率:0.691600
平均每次预测的成功早停率:0.032075



--------------- GIST1M ---------------


--------------- k=100 ---------------

>>> target_recall=0.95
模型预测次数:6762
总模型预测时间(s):0.181681 seconds
100 NN 准确率 = 0.969067
低于要求准确率:0.950000的占比为0.188000
平均每个数据点上的早停率:0.998000
平均每个数据点上的成功早停率:0.810000
平均每次预测的成功早停率:0.119787
>>> target_recall=0.96
模型预测次数:7290
总模型预测时间(s):0.181690 seconds
100 NN 准确率 = 0.976197
低于要求准确率:0.960000的占比为0.176000
平均每个数据点上的早停率:0.996000
平均每个数据点上的成功早停率:0.821000
平均每次预测的成功早停率:0.112620
>>> target_recall=0.97
模型预测次数:8513
总模型预测时间(s):0.225988 seconds
100 NN 准确率 = 0.983457
低于要求准确率:0.970000的占比为0.156000
平均每个数据点上的早停率:0.942000
平均每个数据点上的成功早停率:0.789000
平均每次预测的成功早停率:0.092682
>>> target_recall=0.98
模型预测次数:11291
总模型预测时间(s):0.275672 seconds
100 NN 准确率 = 0.990428
低于要求准确率:0.980000的占比为0.116000
平均每个数据点上的早停率:0.661000
平均每个数据点上的成功早停率:0.565000
平均每次预测的成功早停率:0.050040
>>> target_recall=0.99
模型预测次数:12080
总模型预测时间(s):0.298815 seconds
100 NN 准确率 = 0.993818
低于要求准确率:0.990000的占比为0.133000
平均每个数据点上的早停率:0.417000
平均每个数据点上的成功早停率:0.353000
平均每次预测的成功早停率:0.029222



--------------- DEEP10M ---------------


--------------- k=100 ---------------

>>> target_recall=0.95
模型预测次数:72835
总模型预测时间(s):0.854957 seconds
100 NN 准确率 = 0.971904
低于要求准确率:0.950000的占比为0.153700
平均每个数据点上的早停率:0.969800
平均每个数据点上的成功早停率:0.820700
平均每次预测的成功早停率:0.112679
>>> target_recall=0.96
模型预测次数:78348
总模型预测时间(s):0.920271 seconds
100 NN 准确率 = 0.978677
低于要求准确率:0.960000的占比为0.142800
平均每个数据点上的早停率:0.956200
平均每个数据点上的成功早停率:0.820100
平均每次预测的成功早停率:0.104674
>>> target_recall=0.97
模型预测次数:84706
总模型预测时间(s):0.955118 seconds
100 NN 准确率 = 0.984300
低于要求准确率:0.970000的占比为0.140900
平均每个数据点上的早停率:0.935400
平均每个数据点上的成功早停率:0.807400
平均每次预测的成功早停率:0.095318
>>> target_recall=0.98
模型预测次数:96218
总模型预测时间(s):1.113662 seconds
100 NN 准确率 = 0.989907
低于要求准确率:0.980000的占比为0.129600
平均每个数据点上的早停率:0.903900
平均每个数据点上的成功早停率:0.794200
平均每次预测的成功早停率:0.082542
>>> target_recall=0.99
模型预测次数:117601
总模型预测时间(s):1.340139 seconds
100 NN 准确率 = 0.994058
低于要求准确率:0.990000的占比为0.130800
平均每个数据点上的早停率:0.824500
平均每个数据点上的成功早停率:0.728900
平均每次预测的成功早停率:0.061981
